<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"301c97a728fb59928f4ab11a20a6362d7c352521bc5d6ef659c8373f87ec11c0","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #1295 at https://github.com/cal-itp/data-infra/actions/runs/20790623666","plan_out_hash":"11a0ab336ebb8e5c7406852c6b6a5254e471c99a7b52749f28c1197cbac52957","plan_hash":"74ad183f4a38d5155bf9bc732fc4ee386d4d4bd9fb3b588a9c3f858dd3a9f912","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 2 to add, 3 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer["plugins/hooks/download_config_hook.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "Z+U4pQ==" -> (known after apply)
!~      detect_md5hash      = "I4iIVpR8L4gjKjoPCRDUag==" -> "different hash"
!~      generation          = 1767749840533807 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/hooks/download_config_hook.py"
!~      md5hash             = "I4iIVpR8L4gjKjoPCRDUag==" -> (known after apply)
        name                = "plugins/hooks/download_config_hook.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/operators/download_config_to_gcs_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "zX3z6Q==" -> (known after apply)
!~      detect_md5hash      = "DhZw07Rb7smDB+PbJ7EJgg==" -> "different hash"
!~      generation          = 1767749840529542 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/operators/download_config_to_gcs_operator.py"
!~      md5hash             = "DhZw07Rb7smDB+PbJ7EJgg==" -> (known after apply)
        name                = "plugins/operators/download_config_to_gcs_operator.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["macros/create_row_access_policy.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "jU/ULQ==" -> (known after apply)
!~      detect_md5hash      = "5ApjIYkpEKzfmu3CqOk8sg==" -> "different hash"
!~      generation          = 1767225544077513 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/macros/create_row_access_policy.sql"
!~      md5hash             = "5ApjIYkpEKzfmu3CqOk8sg==" -> (known after apply)
        name                = "data/warehouse/macros/create_row_access_policy.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/payments/fct_payments_rides_enghouse.sql"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "data/warehouse/models/mart/payments/fct_payments_rides_enghouse.sql"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../warehouse/models/mart/payments/fct_payments_rides_enghouse.sql"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["seeds/payments_entity_mapping_enghouse.csv"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "data/warehouse/seeds/payments_entity_mapping_enghouse.csv"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../warehouse/seeds/payments_entity_mapping_enghouse.csv"
+       storage_class  = (known after apply)
    }

Plan: 2 to add, 3 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #1295](https://github.com/cal-itp/data-infra/actions/runs/20790623666)